sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32f7.c
/**
* @file        ExtFlash.c
*
* @brief       manager for QSPI Flash - Implementation -
*
* @author      Nick
*
* @riskClass   C
*
* @moduleID
*
* @vcsInfo
*     $Id: ExtFlash_stm32f7.c 150 2022-10-24 15:30:31Z stefano $
*
*     $Revision: 150 $
*
*     $Author: stefano $
*
*     $Date: 2022-10-24 17:30:31 +0200 (lun, 24 ott 2022) $
*
*
* @copyright
*       Copyright (C) 2017 SCAME S.p.A. All rights reserved.
*       This file is copyrighted and the property of Aesys S.p.A.. It contains confidential and proprietary
*       information. Any copies of this file (in whole or in part) made by any method must also include a copy of this
*       legend.
*       Developed by:  SCAME S.p.A.
***********************************************************************************************************************/

/************************************************************
 * Include
 ************************************************************/
#include <string.h>
#include "stm32f7xx_hal.h"
#include "stm32f7xx_hal_dma.h"
#include "ff.h"
#include "ffconf.h"
#include "main.h"
#include "ExtFlash.h"
#include "cmsis_os.h"
#include "flashFat.h"

/*
*********************************** AESYS ************************************
**                                                                          **
**                            Global Variables                              **
**                                                                          **
******************************************************************************
*/
// Struttura FAT simulata su QSPI
struct StructFAT FAT;

// Tipo di QSPI
unsigned char QSPIModel;

// Info sulla QSPI in uso
QSPI_Info QSPIInformation;
unsigned char FlashID[10];
unsigned char WriteOptimization;

// Dettagli dimensioni flash QSPI
unsigned int FlashDimBlk, FlashDimPag;

// Puntatore al buffer di backup
unsigned int  PBackupQSPI;

extern osThreadId_t wifiMngTaskHandle;


/*
*********************************** AESYS ************************************
**                                                                          **
**                            Local  Variables                              **
**                                                                          **
******************************************************************************
*/

/*
*********************************** AESYS ************************************
**                                                                          **
**                            External Variables                            **
**                                                                          **
******************************************************************************
*/
// Struttura per pilotare la QSPI
extern QSPI_HandleTypeDef hqspi;

// Semaforo
extern osSemaphoreId FlashSemaphoreHandle;


/*
*********************************** AESYS ************************************
**                                                                          **
**                            External Function                             **
**                                                                          **
******************************************************************************
*/


/*
*********************************** AESYS ************************************
**                                                                          **
**                            Internal Function prototype                   **
**                                                                          **
******************************************************************************
*/
// Funzioni gestione flash
static uint8_t QSPI_WriteEnable           (void);
static uint8_t QSPI_AutoPollingMemReady   (uint32_t Timeout);
#ifdef USE_ERASE_CHIP
static uint8_t BSP_QSPI_Erase_Chip        (void);
#endif
static uint8_t BSP_QSPI_Read              (uint8_t* pData, uint32_t ReadAddr, uint32_t Size);
static uint8_t BSP_QSPI_Write             (uint8_t* pData, uint32_t WriteAddr, uint32_t Size);
static uint8_t BSP_QSPI_GetStatusReg1     (uint8_t *reg);
static uint8_t BSP_QSPI_GetConfigReg1     (uint8_t *reg);
static uint8_t BSP_QSPI_SetQuadMode       (void);
static uint8_t BSP_QSPI_Erase_SubBlock    (uint32_t BlockAddress);

//-----------------------------------------------------------------
// Inizio routine gestione FLASH a basso livello
//-----------------------------------------------------------------


/**
  * @brief  This function send a Write Enable and wait it is effective.
  * @retval None
  */
static uint8_t QSPI_WriteEnable(void)
{
  QSPI_CommandTypeDef     s_command;
  QSPI_AutoPollingTypeDef s_config;

  /* Enable write operations */
  s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  s_command.Instruction       = WRITE_ENABLE_CMD;
  s_command.AddressMode       = QSPI_ADDRESS_NONE;
  s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode          = QSPI_DATA_NONE;
  s_command.DummyCycles       = 0;
  s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
  s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

  if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  /* Configure automatic polling mode to wait for write enabling */
  s_config.Match           = FLASH_SR_WREN;
  s_config.Mask            = FLASH_SR_WREN;
  s_config.MatchMode       = QSPI_MATCH_MODE_AND;
  s_config.StatusBytesSize = 1;
  s_config.Interval        = 0x10;
  s_config.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

  s_command.Instruction    = READ_STATUS_REG_CMD;
  s_command.DataMode       = QSPI_DATA_1_LINE;

  if (HAL_QSPI_AutoPolling(&hqspi, &s_command, &s_config, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  return QSPI_OK;
}

/**
  * @brief  This function read the SR of the memory and wait the EOP.
  * @retval None
  */
static uint8_t QSPI_AutoPollingMemReady(uint32_t Timeout)
{
  QSPI_CommandTypeDef     s_command;
  QSPI_AutoPollingTypeDef s_config;

  /* Configure automatic polling mode to wait for memory ready */
  s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  s_command.Instruction       = READ_STATUS_REG_CMD;
  s_command.AddressMode       = QSPI_ADDRESS_NONE;
  s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode          = QSPI_DATA_1_LINE;
  s_command.DummyCycles       = 0;
  s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
  s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

  s_config.Match           = 0;
  s_config.Mask            = FLASH_SR_WIP | FLASH_SR_WREN;
  s_config.MatchMode       = QSPI_MATCH_MODE_AND;
  s_config.StatusBytesSize = 1;
  s_config.Interval        = 0x10;
  s_config.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

  if (HAL_QSPI_AutoPolling(&hqspi, &s_command, &s_config, Timeout) != HAL_OK)
  {
    return QSPI_ERROR;
  }

