sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32f7.c
  /* Send the command */
  if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  /* Configure automatic polling mode to wait for end of erase */
  if (QSPI_AutoPollingMemReady(FLASH_SUBSECTOR_ERASE_MAX_TIME) != QSPI_OK)
  {
    return QSPI_ERROR;
  }

  return QSPI_OK;
}

/**
  * @brief  Erases the specified sub-block of the QSPI memory.
  * @param  BlockAddress: Block address to erase
  * @retval QSPI memory status
  */
static uint8_t BSP_QSPI_Erase_SubBlock(uint32_t BlockAddress)
{
  QSPI_CommandTypeDef s_command;

  /* Initialize the erase command */
  s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;

  if (QSPIModel != sFLASH_UNKNOWN)
  {
    s_command.Instruction       = SECTOR_4K_ERASE_CMD;
    s_command.AddressMode       = QSPI_ADDRESS_1_LINE; //QSPIInformation.numAddressLine; //QSPI_ADDRESS_1_LINE;
    s_command.AddressSize       = QSPI_ADDRESS_24_BITS;
    s_command.Address           = BlockAddress;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode          = QSPI_DATA_NONE;
    s_command.DummyCycles       = 0;
    s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    /* Enable write operations */
    if (QSPI_WriteEnable() != QSPI_OK)
    {
      return QSPI_ERROR;
    }

    /* Send the command */
    if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return QSPI_ERROR;
    }

    /* Configure automatic polling mode to wait for end of erase */
    if (QSPI_AutoPollingMemReady(FLASH_SUBSECTOR_ERASE_MAX_TIME) != QSPI_OK)
    {
      return QSPI_ERROR;
    }
  }

  return QSPI_OK;
}

#ifdef USE_ERASE_CHIP
/**
  * @brief  Erases the entire QSPI memory.
  * @retval QSPI memory status
  */
static uint8_t BSP_QSPI_Erase_Chip(void)
{
  QSPI_CommandTypeDef s_command;

  /* Initialize the erase command */
  s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;

  if ((QSPIModel == QSPI_N25Q512A))
    s_command.Instruction       = BULK_ERASE_CMD;
  else if (QSPIModel == QSPI_MT25QL01G)
    s_command.Instruction       = MT25QL01G_BULK_ERASE_CMD;
  else if (QSPIModel == QSPI_MT25Q512A)
    s_command.Instruction       = MT25QL01G_BULK_ERASE_QUAD_CMD;

  s_command.AddressMode       = QSPI_ADDRESS_NONE;
  s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode          = QSPI_DATA_NONE;
  s_command.DummyCycles       = 0;
  s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
  s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

  /* Enable write operations */
  if (QSPI_WriteEnable() != QSPI_OK)
  {
    return QSPI_ERROR;
  }

  /* Send the command */
  if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  /* Configure automatic polling mode to wait for end of erase */
  if (QSPI_AutoPollingMemReady(N25Q512A_BULK_ERASE_MAX_TIME) != QSPI_OK)
  {
    return QSPI_ERROR;
  }

  return QSPI_OK;
}
#endif

/**
  * @brief
  * @retval
  */
static uint8_t BSP_QSPI_SetQuadMode(void)
{
  uint8_t statusReg;
  uint8_t configReg;

  if ((QSPIModel == sFLASH_W25Q80DV) || (QSPIModel == sFLASH_W25Q016DV))
  {
    BSP_QSPI_GetStatusReg1(&statusReg);
    BSP_QSPI_GetConfigReg1(&configReg);

    /* Update non-volatile configuration register 1 (CR1) */
    if (!TestBit(configReg, 1) || !TestBit(configReg, 6) || !TestBit(configReg, 7))
    {
      QSPI_CommandTypeDef s_command;
      QSPI_AutoPollingTypeDef s_config;

      /* Initialize the read flag status register command */
      s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
      s_command.Instruction       = WRITE_CFG_REG_CMD;
      s_command.AddressMode       = QSPI_ADDRESS_NONE;
      s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
      s_command.DataMode          = QSPI_DATA_1_LINE;
      s_command.DummyCycles       = 0;
      s_command.NbData            = 2;
      s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
      s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
      s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

      Set_Bit(configReg, 1);
      //Set_Bit(configReg, 6);
      ResetBit(configReg, 6);
      uint8_t data[] = { statusReg, configReg };

      QSPI_WriteEnable();

      if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return QSPI_ERROR;
      }

      /* Transmission of the data */
      if (HAL_QSPI_Transmit(&hqspi, data, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return QSPI_ERROR;
      }

      s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
      s_command.Instruction       = READ_STATUS_REG_CMD;
      s_command.AddressMode       = QSPI_ADDRESS_NONE;
      s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
      s_command.DataMode          = QSPI_DATA_1_LINE;
      s_command.DummyCycles       = 0;
      s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
      s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
      s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

      /* Configure automatic polling mode to wait for write enabling */
      s_config.Match           = 0;
      s_config.Mask            = FLASH_BIT_SR_WREN | FLASH_BIT_SR_WIP;
      s_config.MatchMode       = QSPI_MATCH_MODE_AND;
      s_config.StatusBytesSize = 1;
      s_config.Interval        = 0x10;
      s_config.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

      if (HAL_QSPI_AutoPolling(&hqspi, &s_command, &s_config, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        BSP_QSPI_GetStatusReg1(&statusReg);
        return QSPI_ERROR;
      }
    }

    BSP_QSPI_GetStatusReg1(&statusReg);
  }
  else if ((QSPIModel == sFLASH_IS25LP016) || (QSPIModel == sFLASH_IS25LP080))
  {
    QSPI_CommandTypeDef     s_command;
    QSPI_AutoPollingTypeDef s_config;

    BSP_QSPI_GetStatusReg1(&statusReg);

    /* Update non-volatile configuration register  (CR) */
    if (!TestBit(statusReg, 6))
    {
      /* Initialize the read flag status register command */
      s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
      s_command.Instruction       = WRITE_CFG_REG_CMD;
      s_command.AddressMode       = QSPI_ADDRESS_NONE;
      s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
      s_command.DataMode          = QSPI_DATA_1_LINE;
      s_command.DummyCycles       = 0;
      s_command.NbData            = 1;
      s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
      s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
      s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

