sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32f7.c
      Set_Bit(statusReg, 6);  /* set bit QE as in data sheet Table 6.1 pag 15  */

      QSPI_WriteEnable();

      if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return QSPI_ERROR;
      }

      /* Transmission of the data */
      if (HAL_QSPI_Transmit(&hqspi, (uint8_t*)&statusReg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return QSPI_ERROR;
      }

      s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
      s_command.Instruction       = READ_STATUS_REG_CMD;
      s_command.AddressMode       = QSPI_ADDRESS_NONE;
      s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
      s_command.DataMode          = QSPI_DATA_1_LINE;
      s_command.DummyCycles       = 0;
      s_command.NbData            = 1;
      s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
      s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
      s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

      /* Configure automatic polling mode to wait for write enabling */
      s_config.Match           = 0;
      s_config.Mask            = FLASH_BIT_SR_WREN | FLASH_BIT_SR_WIP;
      s_config.MatchMode       = QSPI_MATCH_MODE_AND;
      s_config.StatusBytesSize = 1;
      s_config.Interval        = 0x10;
      s_config.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

      if (HAL_QSPI_AutoPolling(&hqspi, &s_command, &s_config, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return QSPI_ERROR;
      }
    }
  }
  else if (QSPIModel == sFLASH_SST26VF016B)
  {
    QSPI_CommandTypeDef     s_command;
    QSPI_AutoPollingTypeDef s_config;

    BSP_QSPI_GetStatusReg1(&statusReg);
    BSP_QSPI_GetConfigReg1(&configReg);

    /* Update non-volatile configuration register  (CR) */
    if (!TestBit(configReg, 1) || TestBit(configReg, 7))
    {
      /* Initialize the read flag status register command */
      s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
      s_command.Instruction       = WRITE_CFG_REG_CMD;
      s_command.AddressMode       = QSPI_ADDRESS_NONE;
      s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
      s_command.DataMode          = QSPI_DATA_1_LINE;
      s_command.DummyCycles       = 0;
      s_command.NbData            = 2;
      s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
      s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
      s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

      Set_Bit(configReg, 1);
      ResetBit(configReg, 7);
      uint8_t data[] = { statusReg, configReg };

      QSPI_WriteEnable();

      if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return QSPI_ERROR;
      }

      /* Transmission of the data */
      if (HAL_QSPI_Transmit(&hqspi, data, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return QSPI_ERROR;
      }

      s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
      s_command.Instruction       = READ_STATUS_REG_CMD;
      s_command.AddressMode       = QSPI_ADDRESS_NONE;
      s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
      s_command.DataMode          = QSPI_DATA_1_LINE;
      s_command.DummyCycles       = 0;
      s_command.NbData            = 1;
      s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
      s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
      s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

      /* Configure automatic polling mode to wait for write enabling */
      s_config.Match           = 0;
      s_config.Mask            = FLASH_BIT_SR_WREN | FLASH_BIT_SR_WIP;
      s_config.MatchMode       = QSPI_MATCH_MODE_AND;
      s_config.StatusBytesSize = 1;
      s_config.Interval        = 0x10;
      s_config.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

      if (HAL_QSPI_AutoPolling(&hqspi, &s_command, &s_config, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
      {
        return QSPI_ERROR;
      }
    }

    /* unprotect the device */
    /* Enable write operations */
    s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
    s_command.Instruction       = GLOBAL_BLOCK_PROTECTION_UNLOCK_CMD;
    s_command.AddressMode       = QSPI_ADDRESS_NONE;
    s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
    s_command.DataMode          = QSPI_DATA_NONE;
    s_command.DummyCycles       = 0;
    s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
    s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
    s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

    if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return QSPI_ERROR;
    }

    /* Configure automatic polling mode to wait for write enabling */
    s_config.Match           = 0;
    s_config.Mask            = FLASH_SR_WREN | FLASH_SR_WIP;
    s_config.MatchMode       = QSPI_MATCH_MODE_AND;
    s_config.StatusBytesSize = 1;
    s_config.Interval        = 0x10;
    s_config.AutomaticStop   = QSPI_AUTOMATIC_STOP_ENABLE;

    s_command.Instruction    = READ_STATUS_REG_CMD;
    s_command.DataMode       = QSPI_DATA_1_LINE;

    if (HAL_QSPI_AutoPolling(&hqspi, &s_command, &s_config, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
    {
      return QSPI_ERROR;
    }

    return QSPI_OK;
  }
  else
  {
    return QSPI_ERROR;
  }

  return QSPI_OK;
}


/**
  * @brief  Reads current status register 1 of the QSPI memory.
  * @retval QSPI status register 1
  */
static uint8_t BSP_QSPI_GetStatusReg1(uint8_t *reg)
{
  QSPI_CommandTypeDef s_command;

  /* Initialize the read flag status register command */
  s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  s_command.Instruction       = READ_STATUS_REG_CMD;
  s_command.AddressMode       = QSPI_ADDRESS_NONE;
  s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode          = QSPI_DATA_1_LINE;
  s_command.DummyCycles       = 0;
  s_command.NbData            = 1;
  s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
  s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

  /* Configure the command */
  if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  /* Reception of the data */
  if (HAL_QSPI_Receive(&hqspi, reg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

