sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32f7.c
  return QSPI_OK;
}

/**
  * @brief  Reads current configuration register 1 of the QSPI memory.
  * @retval QSPI configuration register 1
  */
static uint8_t BSP_QSPI_GetConfigReg1(uint8_t *reg)
{
  QSPI_CommandTypeDef s_command;

  /* Initialize the read flag status register command */
  s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  s_command.Instruction       = READ_CFG_REG_CMD;
  s_command.AddressMode       = QSPI_ADDRESS_NONE;
  s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode          = QSPI_DATA_1_LINE;
  s_command.DummyCycles       = 0;
  s_command.NbData            = 1;
  s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
  s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

  /* Configure the command */
  if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  /* Reception of the data */
  if (HAL_QSPI_Receive(&hqspi, reg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  return QSPI_OK;
}

/**
  * @brief  Reads current status of the QSPI memory.
  * @retval QSPI memory status
  */
uint8_t BSP_QSPI_GetStatus(void)
{
  QSPI_CommandTypeDef s_command;
  uint8_t reg;

  /* Initialize the read flag status register command */
  s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  s_command.Instruction       = READ_FLAG_STATUS_REG_CMD;
  s_command.AddressMode       = QSPI_ADDRESS_NONE;
  s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode          = QSPI_DATA_1_LINE;
  s_command.DummyCycles       = 0;
  s_command.NbData            = 1;
  s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
  s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

  /* Configure the command */
  if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  /* Reception of the data */
  if (HAL_QSPI_Receive(&hqspi, &reg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  /* Check the value of the register */
  if ((reg & (FLASH_FSR_PRERR | FLASH_FSR_VPPERR | FLASH_FSR_PGERR | FLASH_FSR_ERERR)) != 0)
  {
    return QSPI_ERROR;
  }
  else if ((reg & (FLASH_FSR_PGSUS | FLASH_FSR_ERSUS)) != 0)
  {
    return QSPI_SUSPENDED;
  }
  else if ((reg & FLASH_FSR_READY) != 0)
  {
    return QSPI_OK;
  }
  else
  {
    return QSPI_BUSY;
  }
}

/**
  * @brief  Return the configuration of the QSPI memory.
  * @param  pInfo: pointer on the configuration structure
  * @retval QSPI memory status
  */
uint8_t BSP_QSPI_GetInfo(QSPI_Info* pInfo)
{
  /* Configure the structure with the memory configuration */
  if (QSPIModel == sFLASH_W25Q80DV)
  {
    pInfo->FlashSize            = FLASH_080_SIZE;
    pInfo->EraseSectorSize      = FLASH_SUBSECTOR_SIZE;
    pInfo->EraseSectorsNumber   = (FLASH_080_SIZE / FLASH_SUBSECTOR_SIZE);
    pInfo->ProgPageSize         = FLASH_PAGE_SIZE;
    pInfo->ProgPagesNumber      = (FLASH_080_SIZE / FLASH_PAGE_SIZE);
    pInfo->numAddressLine       = QSPI_ADDRESS_1_LINE;
    pInfo->numReadDummy         = FLASH_DUMMY_CYCLES_READ_QUAD;
    pInfo->transactionAddress   = FLASH_TRANSACTION_080_ADD;
    pInfo->numTransactionSector = FLASH_TRANSACTION_NUM_SEC;
    return QSPI_OK;
  }
  else
  {
    if (QSPIModel == sFLASH_SST26VF016B)
    {
      pInfo->FlashSize            = FLASH_016_SIZE;
      pInfo->EraseSectorSize      = FLASH_SUBSECTOR_SIZE;
      pInfo->EraseSectorsNumber   = (FLASH_016_SIZE / FLASH_SUBSECTOR_SIZE);
      pInfo->ProgPageSize         = FLASH_PAGE_SIZE;
      pInfo->ProgPagesNumber      = (FLASH_016_SIZE / FLASH_PAGE_SIZE);
      pInfo->numAddressLine       = QSPI_ADDRESS_4_LINES;
      pInfo->numReadDummy         = FLASH_DUMMY_CYCLES_READ_QUAD;
      pInfo->transactionAddress   = FLASH_TRANSACTION_016_ADD;
      pInfo->numTransactionSector = FLASH_TRANSACTION_NUM_SEC;
      return QSPI_OK;
    }
    else
    {
      if (QSPIModel == sFLASH_IS25LP016)
      {
        pInfo->FlashSize            = FLASH_016_SIZE;
        pInfo->EraseSectorSize      = FLASH_SUBSECTOR_SIZE;
        pInfo->EraseSectorsNumber   = (FLASH_016_SIZE / FLASH_SUBSECTOR_SIZE);
        pInfo->ProgPageSize         = FLASH_PAGE_SIZE;
        pInfo->ProgPagesNumber      = (FLASH_016_SIZE / FLASH_PAGE_SIZE);
        pInfo->numAddressLine       = QSPI_ADDRESS_1_LINE;
        pInfo->numReadDummy         = FLASH_DUMMY_CYCLES_READ_QUAD;
        pInfo->transactionAddress   = FLASH_TRANSACTION_016_ADD;
        pInfo->numTransactionSector = FLASH_TRANSACTION_NUM_SEC;
        return QSPI_OK;
      }
      else
      {
        if (QSPIModel == sFLASH_IS25LP080)
        {
          pInfo->FlashSize            = FLASH_080_SIZE;
          pInfo->EraseSectorSize      = FLASH_SUBSECTOR_SIZE;
          pInfo->EraseSectorsNumber   = (FLASH_080_SIZE / FLASH_SUBSECTOR_SIZE);
          pInfo->ProgPageSize         = FLASH_PAGE_SIZE;
          pInfo->ProgPagesNumber      = (FLASH_080_SIZE / FLASH_PAGE_SIZE);
          pInfo->numAddressLine       = QSPI_ADDRESS_1_LINE;
          pInfo->numReadDummy         = FLASH_DUMMY_CYCLES_READ_QUAD;
          pInfo->transactionAddress   = FLASH_TRANSACTION_080_ADD;
          pInfo->numTransactionSector = FLASH_TRANSACTION_NUM_SEC;
          return QSPI_OK;
        }
      }
    }
  }

  return QSPI_ERROR;
}

static uint8_t BSP_QSPI_GetDeviceId(uint8_t* pIdreg, uint8_t len)
{
  QSPI_CommandTypeDef s_command;

  /* Initialize the read flag status register command */
  s_command.InstructionMode   = QSPI_INSTRUCTION_1_LINE;
  s_command.Instruction       = READ_ID_CMD2;
  s_command.AddressMode       = QSPI_ADDRESS_NONE;
  s_command.AlternateByteMode = QSPI_ALTERNATE_BYTES_NONE;
  s_command.DataMode          = QSPI_DATA_1_LINE;
  s_command.DummyCycles       = 0;
  s_command.NbData            = (uint32_t)len;
  s_command.DdrMode           = QSPI_DDR_MODE_DISABLE;
  s_command.DdrHoldHalfCycle  = QSPI_DDR_HHC_ANALOG_DELAY;
  s_command.SIOOMode          = QSPI_SIOO_INST_EVERY_CMD;

  /* Configure the command */
  if (HAL_QSPI_Command(&hqspi, &s_command, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

  /* Reception of the data */
  if (HAL_QSPI_Receive(&hqspi, pIdreg, HAL_QPSI_TIMEOUT_DEFAULT_VALUE) != HAL_OK)
  {
    return QSPI_ERROR;
  }

