sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32f7.c
  return QSPI_OK;
}

//-----------------------------------------------------------------
// Fine routine gestione FLASH a basso livello
//-----------------------------------------------------------------

//-----------------------------------------------------------------
/*
  FlashWrite (Scrive su Flash)

  Valori passati:
    u32_t   indirizzo;
    u8_t *    buffer (buffer da scrivere);
    u32_t   lbuffer (quanti byte scrivere);
    u32_t   lbufferbackup (per ridurre i tempi indicare quanto salvare di ciascun settore)

  Valore di ritorno:
    u8_t  0x00 tutto OK
        0xFF in caso di errore;
*/
//-----------------------------------------------------------------
unsigned char FlashWrite(unsigned int Address, unsigned char *BuffWr, unsigned int LBuffWr, unsigned int LBuffBackup)
{
  // Variabile di controllo operazione su flash
  unsigned char RetErase, RetWrite;
  // Contatore di quanti byte sono stati scritti
  unsigned int BytesWritten, BytesToProcess;

  // Calcolo settore di partenza e settore di fine
  unsigned int StartSector = (Address / FlashDimBlk);
  unsigned int EndSector = ((Address + LBuffWr - 1) / FlashDimBlk);  //<------- aggiunto  - 1

  RetErase = 0x00;
  RetWrite = 0x00;

  // Controllo se il semaforo è libero
  if(osSemaphoreAcquire(FlashSemaphoreHandle, 1000) == osOK)
  {
    // Ciclo di cancellazione settori
    while (StartSector <= EndSector)
    {
      // Cancello il settore
      RetErase = BSP_QSPI_Erase_SubBlock(StartSector * FlashDimBlk);

      if (RetErase != QSPI_OK)
      {
        // Rilascio il semaforo
        osSemaphoreRelease(FlashSemaphoreHandle);
        return (0xFF);
      }

      // Incremento
      StartSector++;
    }

    // Ciclo di scrittura
    // Contatore di quanti byte sono stati scritti
    BytesWritten = 0;
    // Calcolo quanti byte devo scrivere al primo giro
    BytesToProcess = (LBuffWr <= FlashDimBlk) ? LBuffWr : FlashDimBlk;

    while (BytesWritten < LBuffWr)
    {
      // Scrivo
      RetWrite = BSP_QSPI_Write((BuffWr + BytesWritten), Address + BytesWritten, BytesToProcess);

      if (RetWrite != QSPI_OK)
      {
        // Rilascio il semaforo
        osSemaphoreRelease(FlashSemaphoreHandle);
        return(0xFF);
      }

      // Aggiorno le variabili per il prossimo giro
      BytesWritten += BytesToProcess;
      BytesToProcess = ((LBuffWr - BytesWritten) <= FlashDimBlk) ? (LBuffWr - BytesWritten) : FlashDimBlk;
    }

    // Rilascio il semaforo
    osSemaphoreRelease(FlashSemaphoreHandle);
  }

  return(RetWrite);
}
//-----------------------------------------------------------------

/*
  FlashFatWrite (Scrive FAT su Flash cancellando sub-sector da 4K)

  Valori passati:
    u32_t   indirizzo;
    u8_t *    buffer (buffer da scrivere);
    u32_t   lbuffer (quanti byte scrivere);

  Valore di ritorno:
    u8_t  0x00 tutto OK
        0xFF in caso di errore;
*/
//-----------------------------------------------------------------
unsigned char FlashFatWrite(unsigned int Address, unsigned char *BuffWr, unsigned int LBuffWr, unsigned int LBuffBackup)
{
  // Variabile di controllo operazione su flash
  unsigned char RetErase = 0x00, RetWrite = 0x00;
  unsigned char testErase[16];

  // Ciclo di scrittura
  // Contatore di quanti byte sono stati scritti
  unsigned int BytesWritten = 0;
  // Calcolo quanti byte devo scrivere al primo giro
  unsigned int BytesToProcess = (LBuffWr <= FlashDimBlk) ? LBuffWr : FlashDimBlk;

  // Calcolo settore di partenza e settore di fine
  unsigned int StartSector = (Address / FlashDimBlk);
  unsigned int EndSector = ((Address + LBuffWr - 1) / FlashDimBlk);


  // Controllo se il semaforo è libero
  if(osSemaphoreAcquire(FlashSemaphoreHandle, 1000) == osOK)
  {
    // Ciclo di cancellazione settori
    while (StartSector <= EndSector)
    {
      // Cancello il sub-settore
      RetErase = BSP_QSPI_Erase_SubBlock(StartSector * FlashDimBlk);

      if (RetErase != QSPI_OK)
      {
        // Rilascio il semaforo
        osSemaphoreRelease(FlashSemaphoreHandle);
        return (0xFF);
      }

      // Incremento
      RetErase = BSP_QSPI_Read(testErase, (StartSector * FlashDimBlk), sizeof(testErase));

      if ((RetErase != QSPI_OK) || (testErase[0] != 0xFF) || (testErase[1] != 0xFF))
      {
        // Rilascio il semaforo
        osSemaphoreRelease(FlashSemaphoreHandle);
        return(0xFF);
      }

      StartSector++;
    }

    while (BytesWritten < LBuffWr)
    {
      // Scrivo
      RetWrite = BSP_QSPI_Write((BuffWr + BytesWritten), Address + BytesWritten, BytesToProcess);

      if (RetWrite != QSPI_OK)
      {
        // Rilascio il semaforo
        osSemaphoreRelease(FlashSemaphoreHandle);
        return (0xFF);
      }

      // Aggiorno le variabili per il prossimo giro
      BytesWritten += BytesToProcess;
      BytesToProcess = ((LBuffWr - BytesWritten) <= FlashDimBlk) ? (LBuffWr - BytesWritten) : FlashDimBlk;
    }

    // Rilascio il semaforo
    osSemaphoreRelease(FlashSemaphoreHandle);
  }

  return(RetWrite);
}
//-----------------------------------------------------------------


//-----------------------------------------------------------------
/*
  FlashRead (Legge da Flash)

  Valori passati:
    u8_t    indirizzo pagina;
    u8_t *    buffer (buffer in cui inserire i dati letti);
    u32_t   lbuffer (quanti byte leggere);
  Valore di ritorno:
    u8_t  0xFF in caso di errore;
            0x00 se tutto bene;
*/
//-----------------------------------------------------------------
unsigned char FlashRead(unsigned int Address, unsigned char *BuffRd, unsigned int LBuffRd)
{
  // Variabile di controllo operazione su flash
  unsigned char RetRead = 0x00;

  // La lettura fa fatta a "sottosettori"
  // Contatore di quanti byte sono stati letti
  unsigned int BytesRead = 0;
  // Calcolo quanti byte devo leggere al primo giro
  unsigned int BytesToProcess = (LBuffRd <= FlashDimBlk) ? LBuffRd : FlashDimBlk;
  
  // Controllo se il semaforo è libero
  if(osSemaphoreAcquire(FlashSemaphoreHandle, 1000) == osOK)
  {
    while (BytesRead < LBuffRd)
    {
      RetRead = BSP_QSPI_Read((BuffRd + BytesRead), Address + BytesRead, BytesToProcess);
      
      if (RetRead != QSPI_OK)
      {
        // Rilascio il semaforo
        osSemaphoreRelease(FlashSemaphoreHandle);
        return(0xFF);
      }

      // Aggiorno le variabili per il prossimo giro
      BytesRead += BytesToProcess;
      BytesToProcess = ((LBuffRd - BytesRead) <= FlashDimBlk) ? (LBuffRd - BytesRead) : FlashDimBlk;
    }

    // Rilascio il semaforo
    osSemaphoreRelease(FlashSemaphoreHandle);
  }

