sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32f7.c
  return(RetRead);
}
//-----------------------------------------------------------------

//-----------------------------------------------------------------
//  FlashSaveConfiguration
//-----------------------------------------------------------------
unsigned char FlashSaveConfiguration(unsigned char *BuffWr, unsigned int LBuffWr)
{
  unsigned char ErrFlash = 0U;

#ifdef DA_FARE
  // Termino il file
  *(BuffWr + LBuffWr) = 0x00;
  /* quindi la lunghezza si incrementa di uno */
  LBuffWr++;
  char          fullFileName[16] = {'\0'};

  ErrFlash = (unsigned char)TRUE;
  /* il nome del file sarà del tipo:  xC0000000.dat */
  sprintf((char *)fullFileName, "x%08X.", AddressConfiguration);
  /*         destination       source */
  strcat((char *)fullFileName, (char *)FATCONF_EXT);
  unsigned int wLen = FlashFatWriteFile(fullFileName, (char *)BuffWr, LBuffWr, (uint8_t*)FATCONF_EXT, FATFS_DEVICE);

  if (wLen == LBuffWr)
  {
    // writing successfully
    ErrFlash = (unsigned char)FALSE;
  }

#endif
  return(ErrFlash);
}
//-----------------------------------------------------------------



//-----------------------------------------------------------------
/*
  FlashFormat (formatta la flash)

  Valori passati:
    nessuno
  Valore di ritorno:
    u8_t  0xFF in caso di errore;
            0x00 se tutto bene;
*/
//-----------------------------------------------------------------
unsigned char FlashFormat(void)
{
  unsigned char RetVal;
  unsigned int  sector;
  uint32_t address;

  RetVal = address = 0;

#ifdef USE_ERASE_CHIP
  RetVal = BSP_QSPI_Erase_Chip();
#else
#ifndef ERASE_CHIP_WITH_SUBSECTORS

  /*we have 1024 64K sector (512 64K sector from 0x0200.0000=OFFSET_FLASH_ADDRESS to 0x03FF.FFFF) */
  for (sector = 0; sector < FLASH_FAT_NUM_64K_SECTOR; sector++)
  {
    address = OFFSET_FLASH_ADDRESS + (sector * (uint32_t)FLASH_SECTOR_64K_SIZE);
    RetVal = BSP_QSPI_Erase_Block(address);

    if (RetVal != QSPI_OK)
    {
      break;
    }
    else
    {
      refreshWD();
    }
  }

#else

  /*we have 16384 4K subsector. For the FAT we use  8192 4Ksubsector from 0x0200.0000=OFFSET_FLASH_ADDRESS to 0x03FF.FFFF */
  for (sector = 0; sector < (unsigned int)FLASH_FAT_NUM_SECTOR; sector++)
  {
    address = OFFSET_FLASH_ADDRESS + (sector * (uint32_t)0x1000);
    RetVal = BSP_QSPI_Erase_SubBlock(address);

    if (RetVal != QSPI_OK)
    {
      break;
    }
    else
    {
      refreshWD();
    }
  }

#endif
#endif
  return(RetVal);
}

/*
  FlashFormat (formatta la parte di flash dedicata alla configurazione 0x0000.0000-1FFF.FFFF)

  Valori passati:
    nessuno
  Valore di ritorno:
    u8_t  0xFF in caso di errore;
            0x00 se tutto bene;
*/
//-----------------------------------------------------------------
unsigned char FlashConfigFormat(void)
{
  unsigned char RetVal;
  unsigned int  sector;
  uint32_t address;

  RetVal = address = 0;

#ifndef ERASE_CHIP_WITH_SUBSECTORS

  /*we have 1024 64K sector (512 64K sector from 0x0200.0000=OFFSET_FLASH_ADDRESS to 0x03FF.FFFF) */
  for (sector = 0; sector < FLASH_FAT_NUM_64K_SECTOR; sector++)
  {
    address = (uint32_t)0x00000000 + (sector * (uint32_t)FLASH_SECTOR_64K_SIZE);
    RetVal = BSP_QSPI_Erase_Block(address);

    if (RetVal != QSPI_OK)
    {
      break;
    }
    else
    {
      refreshWD();
    }
  }

#endif
  return(RetVal);
}


//-----------------------------------------------------------------
//  FATInit
//-----------------------------------------------------------------
void FATInit(void)
{
#ifdef DA_FARE
  volatile unsigned char ErrFlash, AzzFAT;
  unsigned short LookupValue;
  char          fullFileName[16] = {'\0'};
  unsigned int  readByte, byteToRead;

  LookupValue = 0;
  ErrFlash = 0;
  /* il nome del file sarà del tipo:  x00000000.dat */
  sprintf((char *)fullFileName, "x%08X.", AddressFAT);
  /*         destination       source */
  strcat((char *)fullFileName, (char *)FATCONF_EXT);

  if (FlashFatReadFile(fullFileName, NULL, &byteToRead, (uint8_t*)NULL, FAT_DEVICE_FLASH))
  {
    readByte = (unsigned int)FlashFatReadFile(fullFileName, (char *)&FAT, (unsigned int*)&byteToRead, NULL,  FAT_DEVICE_FLASH);

    if ((readByte == (unsigned int)0) || ( readByte != byteToRead))
    {
      ErrFlash = (unsigned char)0xFF;
    }
  }
  else
  {
    /* file doesn't exist */
    ErrFlash = (unsigned char)0xFF;
  }

#endif
}
//-----------------------------------------------------------------

//-----------------------------------------------------------------
//  FlashInit
//-----------------------------------------------------------------
void FlashInit(void)
{

  // Termino l'inizializzazione cominciata in MX_QUADSPI_Init()
  // La funzione MX_QUADSPI_Init() viene generata in automatico, quindi aggiungo qui le altre funzioni

  // Leggo l'ID della flash
  BSP_QSPI_GetDeviceId((uint8_t*)FlashID, sizeof(FlashID));

  // Controllo se è una flash gestita
  if (memcmp(FlashID, "\xEF\x40\x14", 3) == 0)     /* "\xEF\x40\x14"  WINBOND - W25 - 8Mb */
  {
    QSPIModel = sFLASH_W25Q80DV;
    /* QUADSPI parameter configuration: number of address bit */
    hqspi.Init.FlashSize = FLASH_080_ADDRESS_SIZE;
  }
  else
  {
    if (memcmp(FlashID, "\xEF\x40\x15", 3) == 0)    /* "\xEF\x40\x15"  W25Q16JV WINBOND - W25 - 16Mb */
    {
      QSPIModel = sFLASH_W25Q016DV;
      /* QUADSPI parameter configuration: number of address bit */
      hqspi.Init.FlashSize = FLASH_016_ADDRESS_SIZE;
    }
    else
    {
      if (memcmp(FlashID, "\x9D\x60\x14", 3) == 0)    /* "\x9D\x60\x14"  S25LP080D ISSI - LP - 8Mb */
      {
        QSPIModel = sFLASH_IS25LP080;
        /* QUADSPI parameter configuration: number of address bit  */
        hqspi.Init.FlashSize = FLASH_080_ADDRESS_SIZE;
      }
      else
      {
        if (memcmp(FlashID, "\x9D\x60\x15", 3) == 0)    /* "\x9D\x60\x15"  S25LP016D ISSI - LP - 16Mb */
        {
          QSPIModel = sFLASH_IS25LP016;
          /* QUADSPI parameter configuration: number of address bit  */
          hqspi.Init.FlashSize = FLASH_016_ADDRESS_SIZE;
        }
        else
        {
          if (memcmp(FlashID, "\xBF\x26\x41", 3) == 0)    /* "\xBF\x26\x41"  sFLASH_SST26VF016B Microchip - 26V - 16Mb */
          {
            QSPIModel = sFLASH_SST26VF016B;
            /* QUADSPI parameter configuration: number of address bit  */
            hqspi.Init.FlashSize = FLASH_016_ADDRESS_SIZE;
          }
          else
          {
            QSPIModel = sFLASH_UNKNOWN;
          }
        }
      }
    }
  }

  if (QSPIModel != sFLASH_UNKNOWN)
  {
    if (HAL_QSPI_Init(&hqspi) != HAL_OK) //  reinizializzazione modulo QSPI di STM32F765
    {
      // Flash in errore, blocco tutto
      while(1);
    }

    // Assegno alla struttura Info i valori relativi alla QSPI in uso
    BSP_QSPI_GetInfo(&QSPIInformation);

    FlashDimBlk = QSPIInformation.EraseSectorSize; // Dimensione di un sotto-settore
    FlashDimPag = QSPIInformation.ProgPageSize; // Dimensione di una pagina

