sroggerini/SCU_FW_Develop/Src/Device/ExtFlash_stm32f7.c
    /* uso la flash in QSPI mode */
    BSP_QSPI_SetQuadMode();

  }
  else
  {
    // Flash non gestita, blocco tutto
    //while(1);
  }
}

/**
  * @brief  Return if  QSPI flash has been detected.
  * @param  none
  * @retval QSPI detected status
  */
uint8_t sFLASH_Detected(void)
{
  /* Configure the structure with the memory configuration */
  if ((QSPIModel == sFLASH_W25Q80DV) || (QSPIModel == sFLASH_W25Q016DV) ||
      (QSPIModel == sFLASH_IS25LP016) || (QSPIModel == sFLASH_SST26VF016B) || (QSPIModel == sFLASH_IS25LP080))
  {
    return QSPI_OK;
  }
  else
  {
    return QSPI_ERROR;
  }

}

/**
  * @brief  Erases the specified sub-block of the QSPI memory.
  * @param  BlockAddress: Block address to erase
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_Erase_SubBlock(uint32_t BlockAddress)
{
  return(BSP_QSPI_Erase_SubBlock(BlockAddress));
}

/**
  * @brief  Writes an amount of data to the QSPI memory.
  * @param  pData: Pointer to data to be written
  * @param  WriteAddr: Write start address
  * @param  Size: Size of data to write
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_Write(uint8_t* pData, uint32_t WriteAddr, uint32_t Size)
{
  refreshWD();
  return(BSP_QSPI_Write(pData, WriteAddr, Size));
}

/**
  * @brief  Reads an amount of data to the QSPI memory.
  * @param  pData: Pointer where data read is stored
  * @param  ReadAddr: Read start address
  * @param  Size: Size of data to read
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_Read(uint8_t* pData, uint32_t ReadAddr, uint32_t Size)
{
  return(BSP_QSPI_Read(pData, ReadAddr, Size));
}

/**
  * @brief  Erase data area in QSPI-Flash.
  * @retval QSPI memory status
  */
uint8_t raw_sFLASH_EraseDataArea(void)
{
  uint32_t      qspiAdd;
  uint8_t       result;
  osSemaphoreId semaphoreFat;

  semaphoreFat = getFatSemaphore();

  if(osSemaphoreAcquire(semaphoreFat, portMAX_DELAY) == osOK)
  {
    for (qspiAdd = FLASH_FAT_SIZE; qspiAdd < QSPIInformation.FlashSize; qspiAdd += FLASH_SUBSECTOR_SIZE)
    {
      result = raw_sFLASH_Erase_SubBlock(qspiAdd);
      refreshWD();

      if (result != QSPI_OK)
      {
        break;
      }
    }
  }

  osSemaphoreRelease(semaphoreFat);
  return(result);
}

/**
  * @brief  Erase data area in QSPI-Flash.
  * @param  none
  * @retval char*: pointer to start address data area in QSPI flash
  */
char* pQspiDataArea(void)
{
  return((char*)FLASH_FAT_SIZE);
}


uint8_t getStatusReg(void)
{
  uint8_t statusReg;

  BSP_QSPI_GetStatusReg1(&statusReg);
  return (statusReg);
}

uint8_t getConfigReg(void)
{
  uint8_t configReg;

  BSP_QSPI_GetConfigReg1(&configReg);
  return (configReg);
}


/**
  * @brief  Get address transaction start area
  * @param  none
  * @retval uint32_t: pointer to start address transaction data area in QSPI flash
  */
uint32_t getTransactionAddress(void)
{
  return (QSPIInformation.transactionAddress);
}

//-----------------------------------------------------------------

